examples/toy15_test_10/0/U.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform  (0 0 0);

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform (0 -2.19 0);
        
    }
    
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.water;
        value           $internalField;
    }

    walls
    {
        type            noSlip;
    }
    
    bottom
    {
        type            noSlip;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
