examples/toy15_test_10/constant/physicalProperties.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.0153;
    }
    thermodynamics
    {
        Cp          4184;       // J/(kg·K)
        Hf          0;
    }
    transport
    {
        mu          1e-3;       // Pa·s (viscosity of water at ~20°C)
        Pr          7.0;        // Prandtl number for water at ~20°C
    }
    equationOfState
    {
        rho         1000;       // kg/m³
    }
    
}

// ************************************************************************* //

