examples/toy15_test_10/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "alpha.*"
    {
    	nAlphaCorr      2;
    	nAlphaSubCycles 2;
    	nLimiterIter    10;
    	smoothLimiter   0.1;
    	implicitPhasePressure yes;

    	solver          PBiCGStab;
    	preconditioner  DIC;
    	tolerance       1e-9;
    	relTol          0;
    	minIter         1;
    }
    
    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        tolerance       1e-8;
        relTol          0.01;
        minIter         3;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
        minIter         3;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.01;
        minIter         3;
    }

    "(h|e).*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
        minIter         3;
    }

    "Theta.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.01;
        minIter         3;
    }

    "(k|epsilon).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.01;
        minIter         3;
    }
}

PIMPLE
{
    consistent              yes;
    faceMomentum            yes;
    dragCorrection          yes;
    partialElimination      no;
    nOuterCorrectors        5;
    nCorrectors             2;
    nNonOrthogonalCorrectors 1;
    momentumPredictor       yes;
}

relaxationFactors
{
    fields
    {
        p_rgh 0.3;
    }
    equations
    {
        ".*U.*"        0.3;
        ".*alpha.*"    0.3;
        ".*Theta.*"    0.2;
        ".*k.*"        0.3;
        ".*epsilon.*"  0.3;
    }
}
// ************************************************************************* //
