examples/toy15_test_10/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}

setFormat      raw;

interpolationScheme cellPoint;  // ou cell, se preferir

fields
(
    alpha.particles
);

sets
(
    profile_y30cm
    {
        type        line;
        axis        x;
        start       (0 0.3 0);
        end         (1.2 0.3 0);
        nPoints     500;
    }

    profile_y40cm
    {
        type        line;
        axis        x;
        start       (0 0.4 0);
        end         (1.2 0.4 0);
        nPoints     500;
    }

    profile_y50cm
    {
        type        line;
        axis        x;
        start       (0 0.5 0);
        end         (1.2 0.5 0);
        nPoints     500;
    }

    profile_y60cm
    {
        type        line;
        axis        x;
        start       (0 0.6 0);
        end         (1.2 0.6 0);
        nPoints     500;
    }
);


// ************************************************************************* //
